backend/tests/load/artillery/bid-consistency.yml
# Artillery bid consistency test: ~100 VU
#
# Tests: Price monotonicity, CAS correctness, idempotency under load
#
# Usage:
#   cd backend && pnpm load:consistency       (默认测试环境 localhost:3002)

config:
  target: 'http://localhost:3002'
  phases:
    - duration: 10
      arrivalRate: 5
      name: 'Ramp up'
    - duration: 30
      arrivalRate: 20
      name: 'Sustained load'

  socketio:
    transports: ['websocket']

  engines:
    socketio-v3: {}

  processor: './socketio-processor.cjs'

  ensure:
    conditions:
      - expression: 'vusers.created > 0'
        strict: true

scenarios:
  - name: 'Concurrent bidding stress'
    engine: socketio-v3
    weight: 1

    flow:
      # 1. Generate unique username
      - function: 'uniqueUsername'

      # 2. Register + Login (via processor)
      - function: 'registerAndLogin'

      # 3. Set socket auth params
      - function: 'setSocketAuth'

      # 4. Connect to Socket.IO (auth resolved at runtime)
      - connect:
          namespace: '/'
          auth:
            token: '{{ token }}'

      # 5. Join room
      - emit:
          channel: 'auction:join'
          data:
            roomId: 1

      - think: 0.2

      # 6. Submit 5 bids (rapid fire - testing CAS under contention)
      - loop:
          - function: 'generateIdempotencyKey'
          - emit:
              channel: 'bid:submit'
              data:
                sessionId: 1
                idempotencyKey: '{{ idempotencyKey }}'
              acknowledge:
                capture:
                  - json: '$.0'
                    as: 'bidAck'
          - function: 'recordBidAck'
          - think: 0.2
        count: 5

      # 7. Brief hold for broadcast receipt
      - think: 3