backend/tests/load/artillery/bid-high-load-500.yml
# Artillery high-load bid test: ~500 VU
#
# Tests: CAS correctness, broadcast sync, idempotency under 500-user load
#
# Usage:
#   cd backend && pnpm load:high500

config:
  target: 'http://localhost:3002'
  phases:
    - duration: 20
      arrivalRate: 10
      name: 'Ramp up'
    - duration: 40
      arrivalRate: 25
      name: 'Sustained 500 VU load'
    - duration: 10
      arrivalRate: 5
      name: 'Cool down'

  socketio:
    transports: ['websocket']

  engines:
    socketio-v3: {}

  processor: './socketio-processor.cjs'

  ensure:
    conditions:
      - expression: 'vusers.created > 0'
        strict: true

scenarios:
  - name: 'High concurrency bidding - 500 VU'
    engine: socketio-v3
    weight: 1

    flow:
      # 1. Generate unique username
      - function: 'uniqueUsername'

      # 2. Register + Login (via processor)
      - function: 'registerAndLogin'

      # 3. Set socket auth params
      - function: 'setSocketAuth'

      # 4. Connect to Socket.IO (auth resolved at runtime)
      - connect:
          namespace: '/'
          auth:
            token: '{{ token }}'

      # 5. Join room
      - emit:
          channel: 'auction:join'
          data:
            roomId: 1

      - think: 0.5

      # 6. Submit 5 bids per VU (200ms interval)
      - loop:
          - function: 'generateIdempotencyKey'
          - emit:
              channel: 'bid:submit'
              data:
                sessionId: 1
                idempotencyKey: '{{ idempotencyKey }}'
          - think: 0.2
        count: 5

      # 7. Hold for rank:update receipt
      - think: 5