backend/tests/load/artillery/multi-user-bid.yml
# Artillery multi-user bidding test: ~20 VU x 30s
#
# Tests: End-to-end bid latency, broadcast latency, rank sync latency
#
# Usage:
#   cd backend && pnpm load:bid              (默认测试环境 localhost:3002)

config:
  target: 'http://localhost:3002'
  phases:
    - duration: 5
      arrivalRate: 2
      name: 'Warm up'
    - duration: 30
      arrivalRate: 10
      name: 'Bidding phase'

  socketio:
    transports: ['websocket']

  engines:
    socketio-v3: {}

  processor: './socketio-processor.cjs'

  # Ensure thresholds
  ensure:
    conditions:
      - expression: 'vusers.created > 0'
        strict: true

scenarios:
  - name: 'Multi-user concurrent bidding'
    engine: socketio-v3
    weight: 1

    flow:
      # 1. Generate unique username
      - function: 'uniqueUsername'

      # 2. Register + Login (via processor)
      - function: 'registerAndLogin'

      # 3. Set socket auth params
      - function: 'setSocketAuth'

      # 4. Connect to Socket.IO (auth resolved at runtime)
      - connect:
          namespace: '/'
          auth:
            token: '{{ token }}'

      # 5. Join room
      - emit:
          channel: 'auction:join'
          data:
            roomId: 1

      - think: 0.5

      # 6. Submit 5 bids with random intervals
      - loop:
          - function: 'generateIdempotencyKey'
          - emit:
              channel: 'bid:submit'
              data:
                sessionId: 1
                idempotencyKey: '{{ idempotencyKey }}'
              acknowledge:
                capture:
                  - json: '$.0'
                    as: 'bidAck'
          - function: 'recordBidAck'
          - think: 0.5
        count: 5

      # 7. Hold connection to receive broadcasts
      - think: 10

      # 8. Leave room
      - emit:
          channel: 'auction:leave'
          data:
            roomId: 1