backend/tests/load/artillery/smoke-ci.yml
# Artillery smoke test for CI: ~50 VU x 2min
#
# Goals:
#   - WebSocket connection success rate >= 95%
#   - Non-business error rate < 1%
#
# Usage:
#   cd backend && pnpm load:smoke            (默认测试环境 localhost:3002)

config:
  target: 'http://localhost:3002'
  phases:
    - duration: 30
      arrivalRate: 5
      name: 'Warm up'
    - duration: 60
      arrivalRate: 20
      name: 'Sustained load'

  socketio:
    transports: ['websocket']

  engines:
    socketio-v3: {}

  processor: './socketio-processor.cjs'

  ensure:
    thresholds:
      http.response_time.p95: 500
    conditions:
      - expression: 'http.codes.200 > 0'
        strict: true

scenarios:
  - name: 'Smoke - register and connect'
    engine: socketio-v3
    weight: 1

    flow:
      # 1. Generate unique username
      - function: 'uniqueUsername'

      # 2. Register + Login (via processor to bypass EngineHttp incompatibility)
      - function: 'registerAndLogin'

      # 2.5 Set socket auth params
      - function: 'setSocketAuth'

      # 3. Connect to Socket.IO (auth from connect step - resolved at runtime)
      - connect:
          namespace: '/'
          auth:
            token: '{{ token }}'

      # 4. Join room
      - emit:
          channel: 'auction:join'
          data:
            roomId: 1

      # 4. Hold connection
      - think: 5

      # 5. Leave room
      - emit:
          channel: 'auction:leave'
          data:
            roomId: 1